geomatsi/mcu-tests/esp32-tests/blink-rgb/sdkconfig.defaults
# default target: ESP-C3-01M
CONFIG_IDF_TARGET_ARCH_RISCV=y
CONFIG_IDF_TARGET_ARCH="riscv"
CONFIG_IDF_TARGET="esp32c3"
CONFIG_IDF_TARGET_ESP32C3=y

# custom configuration: LEDs
CONFIG_ENV_GPIO_RANGE_MIN=0
CONFIG_ENV_GPIO_RANGE_MAX=19
CONFIG_ENV_GPIO_IN_RANGE_MAX=19
CONFIG_ENV_GPIO_OUT_RANGE_MAX=19
CONFIG_GPIO_LED_RED=3
CONFIG_GPIO_LED_GREEN=4
CONFIG_GPIO_LED_BLUE=5
CONFIG_BLINK_PERIOD=500

